src/InformationRegisters/НастройкиСчетовМеждународногоУчетаПоОбъектам/НастройкиСчетовМеждународногоУчетаПоОбъектам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиСчетовМеждународногоУчетаПоОбъектам</name>
  <resources>
    <name>СчетУчета</name>
    <type>
      <types>ChartOfAccountsRef.Международный</types>
    </type>
  </resources>
  <resources>
    <name>СчетУчетаДолгосрочный</name>
    <type>
      <types>ChartOfAccountsRef.Международный</types>
    </type>
  </resources>
  <dimensions>
    <name>ПланСчетов</name>
    <type>
      <types>CatalogRef.ПланыСчетовМеждународногоУчета</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НастройкаФормированияПроводок</name>
    <type>
      <types>CatalogRef.НастройкиФормированияПроводокМеждународногоУчета</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипНастройки</name>
    <type>
      <types>EnumRef.ТипыНастроекОтраженияВМеждународномУчете</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъектУчета</name>
    <type>
      <types>EnumRef.ОбъектыФинансовогоУчета</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъектНастройки</name>
    <type>
      <types>DefinedType.ОбъектНастройкиСчетовМеждународногоУчета</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МестоУчета</name>
    <type>
      <types>DefinedType.МестоУчетаОбъектаНастройкиСчетовМеждународногоУчета</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/СчетаМеждународногоУчетаТребующиеНастройки/СчетаМеждународногоУчетаТребующиеНастройки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СчетаМеждународногоУчетаТребующиеНастройки</name>
  <dimensions>
    <name>ПланСчетов</name>
    <type>
      <types>CatalogRef.ПланыСчетовМеждународногоУчета</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НастройкаФормированияПроводок</name>
    <type>
      <types>CatalogRef.НастройкиФормированияПроводокМеждународногоУчета</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъектУчета</name>
    <type>
      <types>EnumRef.ОбъектыФинансовогоУчета</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъектНастройки</name>
    <type>
      <types>DefinedType.ОбъектНастройкиСчетовМеждународногоУчета</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Долгосрочный</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/ОбъектыФинансовогоУчета/ОбъектыФинансовогоУчета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ОбъектыФинансовогоУчета</name>
  <enumValues>
    <name>ДенежныеСредстваВКассах</name>
  </enumValues>
  <enumValues>
    <name>ДенежныеСредстваНаСчетах</name>
  </enumValues>
  <enumValues>
    <name>ДенежныеСредстваВПути</name>
  </enumValues>
  <enumValues>
    <name>АвансыПолученныеОтКлиентов</name>
  </enumValues>
  <enumValues>
    <name>ЗадолженностьКлиентов</name>
  </enumValues>
  <enumValues>
    <name>НДССАвансовПолученных</name>
  </enumValues>
  <enumValues>
    <name>АвансыВыданныеПоставщикам</name>
  </enumValues>
  <enumValues>
    <name>ЗадолженностьПередПоставщиками</name>
  </enumValues>
  <enumValues>
    <name>НДССАвансовВыданных</name>
  </enumValues>
  <enumValues>
    <name>КредитыИЗаймыВыданныеДолг</name>
  </enumValues>
  <enumValues>
    <name>КредитыИЗаймыВыданныеКомиссия</name>
  </enumValues>
  <enumValues>
    <name>КредитыИЗаймыВыданныеПроценты</name>
  </enumValues>
  <enumValues>
    <name>КредитыИЗаймыПолученныеДолг</name>
  </enumValues>
  <enumValues>
    <name>КредитыИЗаймыПолученныеКомиссия</name>
  </enumValues>
  <enumValues>
    <name>КредитыИЗаймыПолученныеПроценты</name>
  </enumValues>
  <enumValues>
    <name>РасчетыПоЗаработнойПлате</name>
  </enumValues>
  <enumValues>
    <name>РасчетыСПодотчетнымиЛицами</name>
  </enumValues>
  <enumValues>
    <name>РасчетыПоЗаймамСотрудникам</name>
  </enumValues>
  <enumValues>
    <name>УслугиПоАренде</name>
  </enumValues>
  <enumValues>
    <name>ОбеспечительныйПлатежПоАренде</name>
  </enumValues>
  <enumValues>
    <name>АрендныеОбязательства</name>
  </enumValues>
  <enumValues>
    <name>ВыкупнаяСтоимостьПоАренде</name>
  </enumValues>
  <enumValues>
    <name>НоменклатураНаСкладе</name>
  </enumValues>
  <enumValues>
    <name>НоменклатураВЦеховойКладовой</name>
  </enumValues>
  <enumValues>
    <name>НоменклатураОтгруженная</name>
  </enumValues>
  <enumValues>
    <name>НоменклатураПереданнаяВПереработку</name>
  </enumValues>
  <enumValues>
    <name>НоменклатураПереданнаяНаХранение</name>
  </enumValues>
  <enumValues>
    <name>НоменклатураПереданнаяНаКомиссию</name>
  </enumValues>
  <enumValues>
    <name>ВыручкаОтПродаж</name>
  </enumValues>
  <enumValues>
    <name>СебестоимостьПродаж</name>
  </enumValues>
  <enumValues>
    <name>НДССПродаж</name>
  </enumValues>
  <enumValues>
    <name>Расходы</name>
  </enumValues>
  <enumValues>
    <name>РасходыНаФинансовомРезультате</name>
  </enumValues>
  <enumValues>
    <name>ПрочиеДоходы</name>
  </enumValues>
  <enumValues>
    <name>НДССПрочихДоходов</name>
  </enumValues>
  <enumValues>
    <name>ВходящийНДС</name>
  </enumValues>
  <enumValues>
    <name>РезервыОценочныеОбязательства</name>
  </enumValues>
  <enumValues>
    <name>МатериалыИРаботыВНезавершенномПроизводстве</name>
  </enumValues>
  <enumValues>
    <name>ТрудозатратыВНезавершенномПроизводстве</name>
  </enumValues>
  <enumValues>
    <name>ПостатейныеЗатратыВНезавершенномПроизводстве</name>
  </enumValues>
  <enumValues>
    <name>СтоимостьНМА</name>
  </enumValues>
  <enumValues>
    <name>АмортизацияНМА</name>
  </enumValues>
  <enumValues>
    <name>СтоимостьНМА_ЦФ</name>
  </enumValues>
  <enumValues>
    <name>АмортизацияНМА_ЦФ</name>
  </enumValues>
  <enumValues>
    <name>СтоимостьОС</name>
  </enumValues>
  <enumValues>
    <name>АмортизацияОС</name>
  </enumValues>
  <enumValues>
    <name>АмортизацияОС_ЦФ</name>
  </enumValues>
  <enumValues>
    <name>СтоимостьОС_ЦФ</name>
  </enumValues>
  <enumValues>
    <name>ДенежныеСредстваВКассахККМ</name>
  </enumValues>
  <enumValues>
    <name>ПрочаяВыручка</name>
  </enumValues>
  <enumValues>
    <name>РезервыПоСомнительнымДолгам</name>
  </enumValues>
  <enumValues>
    <name>ВнутрихозяйственныеРасчеты</name>
  </enumValues>
  <enumValues>
    <name>ОбязательстваПоНеотфактурованнымПоставкам</name>
  </enumValues>
  <enumValues>
    <name>РезервПереоценкиСтоимостиОС</name>
  </enumValues>
  <enumValues>
    <name>РезервПереоценкиСтоимостиНМА</name>
  </enumValues>
  <enumValues>
    <name>ОбязательстваПередКомитентомПоРеализованнымТоварам</name>
  </enumValues>
  <enumValues>
    <name>ОбязательстваПередПринципаломПоРеализованнымУслугам</name>
  </enumValues>
  <enumValues>
    <name>ОбязательстваПередКомитентомПоЗакупкам</name>
  </enumValues>
  <enumValues>
    <name>РасчетыПоНалогамИВзносам</name>
  </enumValues>
  <enumValues>
    <name>РасчетыПоНДС</name>
  </enumValues>
  <enumValues>
    <name>ПрочиеАктивыПассивы</name>
  </enumValues>
  <enumValues>
    <name>НоменклатураВПути</name>
  </enumValues>
  <enumValues>
    <name>ДенежныеДокументы</name>
  </enumValues>
  <enumValues>
    <name>АвансВыкупнойСтоимостиПоАренде</name>
  </enumValues>
  <enumValues>
    <name>ПроцентыПоАренде</name>
  </enumValues>
  <enumValues>
    <name>НДСПоАренде</name>
  </enumValues>
  <enumValues>
    <name>ВводОстатков</name>
  </enumValues>
  <enumValues>
    <name>НДСПоОтгрузкамБезПереходаПраваСобственности</name>
  </enumValues>
  <enumValues>
    <name>ВнутрихозяйственныеРасчетыПоВыделенномуИмуществу</name>
  </enumValues>
  <enumValues>
    <name>РасчетыСРозничнымиПокупателями</name>
  </enumValues>
  <enumValues>
    <name>РасчетыПоВзаимозачетамЗадолженности</name>
  </enumValues>
  <enumValues>
    <name>ЗакрытиеДоходовОтПродолжающихсяОпераций</name>
  </enumValues>
  <enumValues>
    <name>ЗакрытиеРасходовОтПродолжающихсяОпераций</name>
  </enumValues>
  <enumValues>
    <name>ПодарочныеСертификаты</name>
  </enumValues>
  <enumValues>
    <name>ПринятаяВозвратнаяТара</name>
  </enumValues>
  <enumValues>
    <name>ПереданнаяВозвратнаяТара</name>
  </enumValues>
  <enumValues>
    <name>РезервыПоВознаграждениям</name>
  </enumValues>
  <enumValues>
    <name>РезервыПоСтраховымВзносам</name>
  </enumValues>
  <enumValues>
    <name>ПроцентныеРасходыДисконтирования</name>
  </enumValues>
  <enumValues>
    <name>ОбесценениеОС</name>
  </enumValues>
  <enumValues>
    <name>ОбесценениеНМА</name>
  </enumValues>
  <enumValues>
    <name>РезервыПодОбесценениеЗапасов</name>
  </enumValues>
  <enumValues>
    <name>РезервыПодОбесценениеЗапасовПереданных</name>
  </enumValues>
  <enumValues>
    <name>РезервыПодОбесценениеЗапасовВЦеховойКладовой</name>
  </enumValues>
  <enumValues>
    <name>РезервыПодОбесценениеНезавершенногоПроизводства</name>
  </enumValues>
  <enumValues>
    <name>БилетыИБронирование</name>
  </enumValues>
  <enumValues>
    <name>ВыручкаОтПродажБезНДС</name>
  </enumValues>
  <enumValues>
    <name>ПрочаяВыручкаБезНДС</name>
  </enumValues>
  <enumValues>
    <name>НоменклатураПринятаяВПереработкуНаСкладе</name>
  </enumValues>
  <enumValues>
    <name>НоменклатураПринятаяВПереработкуВПроизводстве</name>
  </enumValues>
  <enumValues>
    <name>НоменклатураПринятаяНаХранениеНаСкладе</name>
  </enumValues>
  <enumValues>
    <name>НоменклатураПринятаяНаХранениеВПроизводстве</name>
  </enumValues>
  <enumValues>
    <name>НоменклатураПринятаяНаКомиссию</name>
  </enumValues>
  <enumValues>
    <name>НоменклатураПереданнаяНаСубкомиссию</name>
  </enumValues>
  <enumValues>
    <name>СлужебныйНесобственныеЦенности</name>
  </enumValues>
  <enumValues>
    <name>НоменклатураПринятаяВПереработкуВЦеховойКладовой</name>
  </enumValues>
  <enumValues>
    <name>НоменклатураПринятаяВПереработкуПереданнаяПартнерам</name>
  </enumValues>
  <enumValues>
    <name>НоменклатураПринятаяВПереработкуКСписанию</name>
  </enumValues>
  <enumValues>
    <name>НоменклатураПринятаяНаХранениеВЦеховойКладовой</name>
  </enumValues>
  <enumValues>
    <name>НоменклатураПринятаяНаХранениеПереданнаяПартнерам</name>
  </enumValues>
  <enumValues>
    <name>НоменклатураПринятаяНаХранениеКСписанию</name>
  </enumValues>
  <enumValues>
    <name>ПроцентыДисконтированияРезервов</name>
  </enumValues>
  <enumValues>
    <name>ПереданныеОС</name>
  </enumValues>
  <enumValues>
    <name>АрендныеПлатежи</name>
  </enumValues>
  <enumValues>
    <name>НегарантированнаяЛиквидационнаяСтоимость</name>
  </enumValues>
  <enumValues>
    <name>ПроцентыДисконтированияАрендныхПлатежей</name>
  </enumValues>
</mdclass:Enum>

src/Enums/ТипыНалогов/ТипыНалогов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыНалогов</name>
  <enumValues>
    <name>ЕдиныйНалоговыйПлатеж</name>
  </enumValues>
  <enumValues>
    <name>ЕНВД</name>
  </enumValues>
  <enumValues>
    <name>ЕСХН</name>
  </enumValues>
  <enumValues>
    <name>ЗемельныйНалог</name>
  </enumValues>
  <enumValues>
    <name>НалогНаИмущество</name>
  </enumValues>
  <enumValues>
    <name>НалогНаПрибыль_РегиональныйБюджет</name>
  </enumValues>
  <enumValues>
    <name>НалогНаПрибыль_ФедеральныйБюджет</name>
  </enumValues>
  <enumValues>
    <name>НалогНаПрибыль_НалоговыйАгент</name>
  </enumValues>
  <enumValues>
    <name>НДС</name>
  </enumValues>
  <enumValues>
    <name>НДС_ВвозимыеТовары</name>
  </enumValues>
  <enumValues>
    <name>НДС_НалоговыйАгент</name>
  </enumValues>
  <enumValues>
    <name>НДФЛ</name>
  </enumValues>
  <enumValues>
    <name>НДФЛ_ИП</name>
  </enumValues>
  <enumValues>
    <name>ПрочиеНалогиИСборы</name>
  </enumValues>
  <enumValues>
    <name>ТорговыйСбор</name>
  </enumValues>
  <enumValues>
    <name>ТранспортныйНалог</name>
  </enumValues>
  <enumValues>
    <name>УСН_Доходы</name>
  </enumValues>
  <enumValues>
    <name>УСН_ДоходыМинусРасходы</name>
  </enumValues>
  <enumValues>
    <name>УСН_МинимальныйНалог</name>
  </enumValues>
  <enumValues>
    <name>ПФРПоСуммарномуТарифу</name>
  </enumValues>
  <enumValues>
    <name>ПФРСтраховаяЧасть</name>
  </enumValues>
  <enumValues>
    <name>ПФРНакопительнаяЧасть</name>
  </enumValues>
  <enumValues>
    <name>ПФРДополнительныйТарифЛЭ</name>
  </enumValues>
  <enumValues>
    <name>ПФРДополнительныйТарифШахтеры</name>
  </enumValues>
  <enumValues>
    <name>ПФРЗаЗанятыхНаПодземныхИВредныхРаботах</name>
  </enumValues>
  <enumValues>
    <name>ПФРЗаЗанятыхНаТяжелыхИПрочихРаботах</name>
  </enumValues>
  <enumValues>
    <name>ПФРСПревышения</name>
  </enumValues>
  <enumValues>
    <name>ФФОМС</name>
  </enumValues>
  <enumValues>
    <name>ТФОМС</name>
  </enumValues>
  <enumValues>
    <name>ФСС</name>
  </enumValues>
  <enumValues>
    <name>ФССНС</name>
  </enumValues>
  <enumValues>
    <name>НДФЛДоходыКонтрагентов</name>
  </enumValues>
  <enumValues>
    <name>НДФЛДивиденды</name>
  </enumValues>
  <enumValues>
    <name>НДФЛДивидендыСотрудникам</name>
  </enumValues>
  <enumValues>
    <name>НДФЛДоначисленныйПоРезультатамПроверки</name>
  </enumValues>
  <enumValues>
    <name>НДФЛПередачаЗадолженностиВНалоговыйОрган</name>
  </enumValues>
  <enumValues>
    <name>НДФЛПрочиеРасчетыСПерсоналом</name>
  </enumValues>
  <enumValues>
    <name>НДФЛСПревышения</name>
  </enumValues>
  <enumValues>
    <name>НДФЛДивидендыСПревышения</name>
  </enumValues>
  <enumValues>
    <name>ПФРДоПредельнойВеличины</name>
  </enumValues>
  <enumValues>
    <name>НДС_ОбратноеОбложение</name>
  </enumValues>
  <enumValues>
    <name>АУСН</name>
  </enumValues>
  <enumValues>
    <name>СтраховыеВзносыЕдиныйТариф</name>
  </enumValues>
  <enumValues>
    <name>ОПСИностранныхРаботников</name>
  </enumValues>
  <enumValues>
    <name>ОМСИностранныхРаботников</name>
  </enumValues>
  <enumValues>
    <name>ОССИностранныхРаботников</name>
  </enumValues>
</mdclass:Enum>

src/InformationRegisters/НастройкиСчетовМеждународногоУчетаПоОбъектам/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого ЗаписьНабора Из ЭтотОбъект Цикл
		Если ЗаписьНабора.ТипНастройки = Перечисления.ТипыНастроекОтраженияВМеждународномУчете.ОбщаяПоОбъектуУчета Тогда
			ЗаписьНабора.Организация = Неопределено;
			ЗаписьНабора.МестоУчета = Неопределено;
		ИначеЕсли НЕ ЗначениеЗаполнено(ЗаписьНабора.МестоУчета) Тогда
			ЗаписьНабора.МестоУчета = Неопределено;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(ЗаписьНабора.ОбъектНастройки) Тогда
			ЗаписьНабора.ОбъектНастройки = Неопределено;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	СчетаРасчетовПоНДС = ВыгрузитьКолонки();
	
	Для Каждого ЗаписьНабора Из ЭтотОбъект Цикл
		Если ЗначениеЗаполнено(ЗаписьНабора.СчетУчета) ИЛИ ЗначениеЗаполнено(ЗаписьНабора.СчетУчетаДолгосрочный) Тогда
			СчетаУчетаТребующиеНастройки = РегистрыСведений.СчетаМеждународногоУчетаТребующиеНастройки.СоздатьНаборЗаписей();
			СчетаУчетаТребующиеНастройки.Отбор.ПланСчетов.Установить(ЗаписьНабора.ПланСчетов);
			СчетаУчетаТребующиеНастройки.Отбор.НастройкаФормированияПроводок.Установить(ЗаписьНабора.НастройкаФормированияПроводок);
			СчетаУчетаТребующиеНастройки.Отбор.ОбъектНастройки.Установить(ЗаписьНабора.ОбъектНастройки);
			СчетаУчетаТребующиеНастройки.Отбор.ОбъектУчета.Установить(ЗаписьНабора.ОбъектУчета);
			
			Если ЗначениеЗаполнено(ЗаписьНабора.СчетУчета) И ЗначениеЗаполнено(ЗаписьНабора.СчетУчетаДолгосрочный) Тогда
			ИначеЕсли ЗначениеЗаполнено(ЗаписьНабора.СчетУчета) Тогда
				СчетаУчетаТребующиеНастройки.Отбор.Долгосрочный.Установить(Ложь);
			Иначе
				СчетаУчетаТребующиеНастройки.Отбор.Долгосрочный.Установить(Истина);
			КонецЕсли;
			
			СчетаУчетаТребующиеНастройки.Записать();
		КонецЕсли;
		
		Если ЗаписьНабора.ОбъектУчета = Перечисления.ОбъектыФинансовогоУчета.РасчетыПоНДС
		И НЕ ЗначениеЗаполнено(ЗаписьНабора.ОбъектНастройки) Тогда
			ЗаполнитьЗначенияСвойств(СчетаРасчетовПоНДС.Добавить(), ЗаписьНабора);
		КонецЕсли;
	КонецЦикла;
	
	Если СчетаРасчетовПоНДС.Количество() > 0 Тогда
		ТекстЗапроса = "
		|ВЫБРАТЬ
		|	СчетаРасчетовПоНДС.ПланСчетов КАК ПланСчетов,
		|	СчетаРасчетовПоНДС.НастройкаФормированияПроводок КАК НастройкаФормированияПроводок,
		|	СчетаРасчетовПоНДС.ТипНастройки КАК ТипНастройки,
		|	СчетаРасчетовПоНДС.Организация КАК Организация,
		|	СчетаРасчетовПоНДС.МестоУчета КАК МестоУчета,
		|	СчетаРасчетовПоНДС.СчетУчета КАК СчетУчета,
		|	СчетаРасчетовПоНДС.СчетУчетаДолгосрочный КАК СчетУчетаДолгосрочный
		|ПОМЕСТИТЬ втСчетаРасчетовПоНДС
		|ИЗ
		|	&СчетаРасчетовПоНДС КАК СчетаРасчетовПоНДС
		|ИНДЕКСИРОВАТЬ ПО
		|	ПланСчетов,
		|	НастройкаФормированияПроводок,
		|	ТипНастройки,
		|	Организация,
		|	МестоУчета
		|
		|;
		|
		|ВЫБРАТЬ
		|	СчетаРасчетовПоНДС.ПланСчетов КАК ПланСчетов,
		|	СчетаРасчетовПоНДС.НастройкаФормированияПроводок КАК НастройкаФормированияПроводок,
		|	СчетаРасчетовПоНДС.ТипНастройки КАК ТипНастройки,
		|	ЗНАЧЕНИЕ(Перечисление.ОбъектыФинансовогоУчета.РасчетыПоНалогамИВзносам) КАК ОбъектУчета,
		|	ЗНАЧЕНИЕ(Перечисление.ТипыНалогов.НДС) КАК ОбъектНастройки,
		|	СчетаРасчетовПоНДС.Организация КАК Организация,
		|	СчетаРасчетовПоНДС.МестоУчета КАК МестоУчета,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(НастройкиСчетовУчета.СчетУчета, ЗНАЧЕНИЕ(ПланСчетов.Международный.ПустаяСсылка)) = ЗНАЧЕНИЕ(ПланСчетов.Международный.ПустаяСсылка)
		|			ТОГДА СчетаРасчетовПоНДС.СчетУчета
		|		ИНАЧЕ НастройкиСчетовУчета.СчетУчета
		|	КОНЕЦ КАК СчетУчета,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(НастройкиСчетовУчета.СчетУчетаДолгосрочный, ЗНАЧЕНИЕ(ПланСчетов.Международный.ПустаяСсылка)) = ЗНАЧЕНИЕ(ПланСчетов.Международный.ПустаяСсылка)
		|			ТОГДА СчетаРасчетовПоНДС.СчетУчетаДолгосрочный
		|		ИНАЧЕ НастройкиСчетовУчета.СчетУчетаДолгосрочный
		|	КОНЕЦ КАК СчетУчетаДолгосрочный
		|ИЗ
		|	втСчетаРасчетовПоНДС КАК СчетаРасчетовПоНДС
		|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиСчетовМеждународногоУчетаПоОбъектам КАК НастройкиСчетовУчета
		|	ПО СчетаРасчетовПоНДС.ПланСчетов = НастройкиСчетовУчета.ПланСчетов
		|	 И СчетаРасчетовПоНДС.НастройкаФормированияПроводок = НастройкиСчетовУчета.НастройкаФормированияПроводок
		|	 И СчетаРасчетовПоНДС.ТипНастройки = НастройкиСчетовУчета.ТипНастройки
		|	 И СчетаРасчетовПоНДС.Организация = НастройкиСчетовУчета.Организация
		|	 И СчетаРасчетовПоНДС.МестоУчета = НастройкиСчетовУчета.МестоУчета
		|	 И НастройкиСчетовУчета.ОбъектУчета = ЗНАЧЕНИЕ(Перечисление.ОбъектыФинансовогоУчета.РасчетыПоНалогамИВзносам)
		|	 И НастройкиСчетовУчета.ОбъектНастройки = ЗНАЧЕНИЕ(Перечисление.ТипыНалогов.НДС)
		|ГДЕ
		|	(ЕСТЬNULL(НастройкиСчетовУчета.СчетУчета, ЗНАЧЕНИЕ(ПланСчетов.Международный.ПустаяСсылка)) = ЗНАЧЕНИЕ(ПланСчетов.Международный.ПустаяСсылка)
		|	 И СчетаРасчетовПоНДС.СчетУчета <> ЗНАЧЕНИЕ(ПланСчетов.Международный.ПустаяСсылка))
		|	ИЛИ
		|	(ЕСТЬNULL(НастройкиСчетовУчета.СчетУчетаДолгосрочный, ЗНАЧЕНИЕ(ПланСчетов.Международный.ПустаяСсылка)) = ЗНАЧЕНИЕ(ПланСчетов.Международный.ПустаяСсылка)
		|	 И СчетаРасчетовПоНДС.СчетУчетаДолгосрочный <> ЗНАЧЕНИЕ(ПланСчетов.Международный.ПустаяСсылка))
		|";
		
		Запрос = Новый Запрос(ТекстЗапроса);
		Запрос.УстановитьПараметр("СчетаРасчетовПоНДС", СчетаРасчетовПоНДС);
		Результат = Запрос.Выполнить();
		
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			МенеджерЗаписи = РегистрыСведений.НастройкиСчетовМеждународногоУчетаПоОбъектам.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(МенеджерЗаписи, Выборка);
			МенеджерЗаписи.Записать(Истина);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
